In [1]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [2]:
%%sql 
CREATE TABLE Sailors (
    sid INTEGER PRIMARY KEY,
    sname CHAR(10),
    rating INTEGER,
    age REAL
);

CREATE TABLE Boats (
    bid INTEGER PRIMARY KEY,
    bname CHAR(20),
    color CHAR(10)
);

CREATE TABLE Reserves (
    sid INTEGER,
    bid INTEGER,
    day CHAR(20),
    PRIMARY KEY (sid, bid, day)
);

 * sqlite://
Done.
Done.
Done.

[]

In [3]:
%sql SELECT sql FROM sqlite_master;

 * sqlite://
Done.

[('CREATE TABLE Sailors (\n    sid INTEGER PRIMARY KEY,\n    sname CHAR(10),\n    rating INTEGER,\n    age REAL\n)',),
 ('CREATE TABLE Boats (\n    bid INTEGER PRIMARY KEY,\n    bname CHAR(20),\n    color CHAR(10)\n)',),
 ('CREATE TABLE Reserves (\n    sid INTEGER,\n    bid INTEGER,\n    day CHAR(20),\n    PRIMARY KEY (sid, bid, day)\n)',),
 (None,)]

In [4]:
%%sql 
INSERT INTO Sailors 
VALUES 
    (22, 'Dustin', 7, 45),
    (29, 'Brutus', 1, 33),
    (31, 'Lubber', 8, 55),
    (32, 'Andy', 8, 25),
    (58, 'Rusty', 10, 35),
    (64, 'Horatio', 7, 35),
    (71, 'Zorba', 10, 16),
    (74, 'Horato', 9, 35),
    (85, 'Art', 3, 25.5),
    (95, 'Bob', 3, 63.5);

INSERT INTO Boats
VALUES 
    (101, 'Interlake', 'blue'),
    (102, 'Interlake', 'red'),
    (103, 'Clipper', 'green'),
    (104, 'Marine', 'red');

INSERT INTO Reserves 
VALUES
    (22, 101, '10/10/98'),
    (22, 102, '10/10/98'),
    (22, 103, '10/8/98'),
    (22, 104, '10/7/98'),
    (31, 102, '11/10/98'),
    (31, 103, '11/6/98'),
    (31, 104, '11/12/98'),
    (64, 101, '9/5/98'),
    (64, 102, '9/8/98'),
    (74, 103, '9/8/98');

 * sqlite://
10 rows affected.
4 rows affected.
10 rows affected.

[]

In [8]:
%%sql
SELECT B.bid, COUNT(*) AS reservationcount
FROM Reserves R, Boats B
WHERE R.bid = B.bid
AND B.color = 'red'

 * sqlite://
Done.

[(102, 5)]

In [10]:
%%sql
SELECT S.rating, AVG(age)
FROM Sailors S
GROUP BY S.rating
HAVING count(*) > 1

 * sqlite://
Done.

[(3, 44.5), (7, 40.0), (8, 40.0), (10, 25.5)]

In [12]:
%%sql
SELECT S.rating, AVG(age)
FROM Sailors S
WHERE S.rating > 5
GROUP BY S.rating

 * sqlite://
Done.

[(7, 40.0), (8, 40.0), (9, 35.0), (10, 25.5)]

In [16]:
%%sql
SELECT B.color, COUNT(*) as CNT
FROM Reserves R, Boats B
WHERE R.bid = B.bid 
GROUP BY B.color
ORDER BY CNT DESC
LIMIT 2

 * sqlite://
Done.

[('red', 5), ('green', 3)]

In [22]:
%%sql
SELECT S.sid, COUNT(R.day)
FROM Sailors S
LEFT OUTER JOIN Reserves R ON S.sid = R.sid
GROUP BY S.sid

 * sqlite://
Done.

[(22, 4),
 (29, 0),
 (31, 3),
 (32, 0),
 (58, 0),
 (64, 2),
 (71, 0),
 (74, 1),
 (85, 0),
 (95, 0)]

In [25]:
%%sql
WITH viewname AS (
SELECT S.sid AS id, COUNT(R.day) AS cnt
FROM Sailors S
LEFT OUTER JOIN Reserves R ON S.sid = R.sid
GROUP BY S.sid
) SELECT * FROM viewname WHERE cnt > 1;

 * sqlite://
Done.

[(22, 4), (31, 3), (64, 2)]